import React, { useState } from 'react';
import { View, Text, StyleSheet, StatusBar, TouchableOpacity, ScrollView } from 'react-native';
import { useTheme } from '@react-navigation/native';
import Icon from 'react-native-vector-icons/dist/FontAwesome';
import { Button, Input } from 'galio-framework';

const AgreementScreen = ({navigation}) => {
  const { colors } = useTheme();


  
    return (
      <View style={styles.container}>

        <View style={styles.topTab}>
            <View style={styles.row}>
              <TouchableOpacity onPress={()=>{
                navigation.goBack()
                }}>
                <Icon name="chevron-left" color={"#FFF"} size={20} style={styles.optionTab}/>
              </TouchableOpacity>
              <View style={styles.ViewTitleOnTab}>
                <Text style={styles.titleOnTab}>ข้อตกลงการใช้บริการ</Text>
              </View> 
            </View>
        </View>

        {/* <Text style={styles.titleAgree}>ข้อตกลงการใช้บริการ</Text> */}

        <View style={styles.contentAgree}>
            <ScrollView style={styles.styleScrollView}>
                <Text style={styles.textBold}>คำนำ</Text>
                <Text>{'     '}โปรดอ่านข้อตกลงการใช้บริการอย่างถี่ถ้วน ข้อตกลงจะมีผลบังคับใช้ต่อการใช้บริการของคุณ หากคุณไม่ยินยอมต่อข้อตกลงการใช้บริการ โปรดยกเลิกการใช้งาน หรือหยุดการใช้งานแอปพลิเคชันหรือการบริการ</Text>
                <Text>{'     '}ทางแอปพลิเคชันอาจมีการแก้ไขข้อตกลงในเวลาใดก็ได้ การแก้ไขจะมีผลบังคับใช้ เมื่อประกาศลงบนแอปพลิเคชัน เป็นความรับผิดชอบของคุณที่จะทบทวนข้อตกลงการใช้บริการอย่างสม่ำเสมอ การใช้งานการบริการอย่างต่อเนื่องของคุณภายในจากมีการเปลี่ยนแปลงแก้ไขในข้อกำหนด ไม่ว่าคุณจะทบทวนแล้วหรือไม่ จะถือว่าคุณได้ยินยอมต่อข้อผูกพันในการแก้ไขดังกล่าว</Text>
                <Text>{'     '}แอปพลิเคชันนี้ เป็นแอปพลิเคชันที่ให้บริการแพลตฟอร์มสำหรับผู้ใช้งาน หน้าที่ของแอปพลิเคชันคือ เป็นตัวกลางสื่อสารระหว่างผู้ใช้งาน ทางแอปพลิเคชันนั้นไม่มีความรับผิดชอบใดๆ ต่อการกระทำและ/หรือการละเลยของผู้ให้บริการใดๆ</Text>
                <Text>{'     '}ในกรณีที่เกิดอุบัติเหตุ หรือการสูญเสียที่ตามมา ทางแอปพลิเคชันจะไม่รับผิดชอบความเสียหายใดๆ ที่เกิดขึ้นแก่ผู้ใช้บริการ ไม่ว่าจะโดยประการใด</Text>
                <Text></Text>

                <Text style={styles.textBold}>คำรับรอง รับประกัน และข้อผูกพัน</Text>
                <Text>{'     '}ข้อมูลทั้งหมดที่คุณมอบให้ เป็นข้อมูลตามจริงและถูกต้อง</Text>
                <Text>{'     '}คุณจะใช้ แอปพลิเคชัน, แพลตฟอร์ม, บริการตามหน้าที่ที่ได้กำหนดไว้และอยู่ภายใต้กฎหมาย</Text>
                <Text>{'     '}คุณจะต้องเก็บรหัสผ่านบัญชีหรือข้อมูลยืนยันตัวซึ่งสามารถใช้เข้าถึงการบริการที่เรามอบให้ อย่างปลอดภัยและเป็นความลับ</Text>
                <Text>{'     '}คุณจะต้องไม่ใช้แอปพลิเคชันในการเก็บหรือส่งสิ่งใดก็ตามที่ผิดกฎหมาย หรือ ใช้ในเชิงหลอกลวง</Text>
                <Text>{'     '}คุณจะต้องไม่ให้ผู้อื่นใช้ข้อมูลส่วนตัวของคุณ และคุณไม่สามารถกำหนดหรือส่งต่อบัญชีผู้ใช้งานของคุณแก่ผู้ใดก็ตาม</Text>
                <Text>{'     '}คุณจะต้องไม่ใช้แอปพลิเคชันและ/หรือซอฟต์แวร์เพื่อก่อให้เกิดความรำคาญ หรือประพฤติไม่เหมาะสม หรือ ประพฤติอย่างไม่เคารพต่อผู้ใช้บริการคนอื่น</Text>
                <Text>{'     '}คุณยินยอมที่จะรับผิดชอบต่อความเสียหายหรือสูญหายที่เกิดจากตัวคุณเอง หรือจากฝ่ายอื่นๆที่มีผลมาจากการละเมิดข้อตกลงของคุณ</Text>
                <Text>{'     '}หากคุณเป็นผู้ร่วมเดินทาง คุณจะต้องไม่สร้างความเสียหาย ไม่ว่าจะโดยเจตนาหรอไม่เจตนาก็ตาม ต่อยานพาหนะของคนขับ</Text>
                <Text></Text>

                <Text style={styles.textBold}>การมอบใบอนุญาต และข้อห้ามต่างๆ</Text>
                <Text>{'     '}คุณจะต้องไม่โพสต์, จำหน่ายหรือสร้างใหม่ ไม่ว่าทางใดก็ตามกับ สิ่งที่มีลิขสิทธิ์, เครื่องหมายการค้าหรือข้อมูลที่มีเจ้าของ โดยไม่มีการขอความยินยอมจากเจ้าของข้อมูลล่วงหน้า</Text>
                <Text>{'     '}คุณจะต้องไม่ใช้แอปพลิเคชันเพื่อ</Text>
                <Text>{'     '}(ก) ส่งหรือจัดเก็บสิ่งที่มีการละเมิด, อนาจาร, ข่มขู่, สบประมาทหรือผิดกฎหมายหรือละเมิดสิทธิ รวมถึงแต่ไม่จำกัดเพียงสิ่งที่ไม่สมควรต่อเด็กหรือสิ่งที่ละเมิดความเป็นส่วนตัวของบุคคลที่สาม</Text>
                <Text>{'     '}(ข) พยายามที่จะเข้าสู่ระบบแอปพลิเคชัน, ซอฟต์แวร์, ระบบหรือเครือข่ายที่เกี่ยวข้องโดยไม่ได้รับอนุญาต</Text>
                <Text>{'     '}(ค) ปลอมแปลงเป็นบุคคลใดหรือสิ่งใดก็ตามเพื่อบิดเบือนการติดต่อของคุณกับบุคคลหรือสิ่งอื่น</Text>
                <Text></Text>

                <Text style={styles.textBold}>การประเมิน</Text>
                <Text>{'     '}ผู้ใช้งานจะได้รับการอนุญาตให้ประเมินกันและกันในส่วนของการให้บริการ</Text>
                <Text>{'     '}ทุกๆการประเมินจะถูกบันทึกลงในระบบของแอปพลิเชันโดยอัตโนมัติ และทางแอปพลิเคชันจะวิเคราะห์การประเมินที่ได้รับทั้งหมด</Text>
                <Text></Text>
                <Text style={styles.textBold}>ความเป็นส่วนตัวของข้อมูล และนโยบายป้องกันความเป็นส่วนตัวของข้อมูล</Text>
                {/* <Text>{'     '}แกร็บได้รวบรวมและจัดการข้อมูลส่วนตัวของคุณตามนโยบายคุ้มครองข้อมูลส่วนบุคคลของแกร็บ นโยบายคุ้มครองข้อมูลส่วนบุคคลของแกร็บนั้นมีผลต่อบริการทั้งหมดของแกร็บและข้อตกลงภายในนโยบายจะใช้อ้างอิงเป็นส่วนหนึ่งของข้อตกลง</Text>
                <Text>{'     '}คุณจะต้องไม่ให้ผู้อื่นใช้ข้อมูลส่วนตัวของคุณ และคุณไม่สามารถกำหนดหรือส่งต่อบัญชีผู้ใช้งานของคุณแก่ผู้ใดก็ตามคุณยินยอมอนุญาตให้แกร็บ, บริษัทในเครือและบริษัทที่เกี่ยวข้อง เก็บรวบรวม, ใช้, จัดการและเปิดเผยข้อมูลส่วนตัวตามที่ระบุไว้ในนโยบายคุ้มครองข้อมูลส่วนบุคคลของแกร็บ</Text> */}
                <Text>{'     '}คุณรับรู้ว่าทางแอปพลิเคชันอาจเปิดเผยข้อมูลส่วนตัวของผู้อื่นต่อคุณในระหว่างการใช้บริการ คุณจะต้องการันตีว่าคุณจะใช้ข้อมูลส่วนตัวดังกล่าวในเป้าหมายที่แอปพลิเคชันได้เปิดเผยให้แก่คุณเท่านั้น และไม่นำไปใช้ในเป้าหมายหรือเหตุอื่นๆโดยที่ไม่ได้รับอนุญาต</Text>
                <Text></Text>

                {/* <Text style={styles.textBold}>นโยบายคุ้มครองข้อมูลส่วนบุคคล</Text> */}

            </ScrollView>

        </View>

        <Button round uppercase color="#0097a7"
                 style={styles.buttonRegister}
                 onPress={()=>{
                     navigation.navigate('แนะนำ')
             }}>ยอมรับข้อตกลงและเริ่มใช้บริการ</Button>

      </View>
    );
};

export default AgreementScreen;

const styles = StyleSheet.create({
  container: {
    flex: 1, 
    alignItems: 'center', 
    justifyContent: 'center',
    backgroundColor: '#1C2352',
  },
  styleScrollView : {
    width:'100%',
    flex: 1,
  },
  titleAgree: {
    color: "white",
    fontSize: 20,
},
contentAgree: {
    backgroundColor: "#e0e0e0",
    marginTop: 10,
    marginBottom: 10,
    width: "80%",
    flex: 1,
    borderRadius: 5,
    paddingVertical: 10,
    paddingHorizontal: 15,
},
buttonRegister: {
    width:'70%',    
},

  //top tab
  row: {
    flexDirection: "row"
  },
  topTab: {
    width: '100%',
    color: "#FFF",
    backgroundColor: '#28288C',
  },
  optionTab: {
    paddingBottom: 17,
    paddingTop: 17,
    color: "#FFF",
    paddingLeft: 10,
  },
  titleOnTab: {
    color: "white",
    fontWeight: 'bold',
    fontSize: 18,
  },
  ViewTitleOnTab: {
    marginLeft: 45,
    marginTop: 15,
  },
  textWhite: {
    color: "#FFF",
  },
  textBold: {
    fontWeight: 'bold',
},
});